<template>
  <div>
    <div class="t1 title">Программы лояльности</div>
    <div class="t3 subTitle1">“Верное сердце всегда найдёт достойную награду”</div>
    <div class="t5 autor1">Масутацу Ояма</div>
    <div
      class="t3 subTitle2"
    >“Друзей мы приобретаем не тем, что получаем от них услуги, а тем, что сами их оказываем”</div>
    <div class="t5 autor2">Фукидид</div>
    <div
      class="t5 bigText1"
    >Почитание традиций и негласных правил обществ издавна считается неотъемлемой частью джентельменского клуба. В классическом Лондоне XIX века популярность таких сообществ набирала необыкновенных высот, где из простых кофеин и чайных заведений помещения превращались в места, завсегдатаи которых, обладая совершенно разными профессиями, материальными состояниями и внутренними убеждениями, всегда находили общие ценности. Продолжая наследие таких клубов, мы в Darewin’s Club так же хотим поощрить наших единомышленников, которые являются первопроходцами клуба в такое непростое время. С нашей стороны, Клуб предоставляет возможность принять участие в «чистых» играх, что означает - Клуб не будет взымать комиссию за проведённые матчи. Данная возможность будет действовать до тех пор, пока не будет набрано необходимое количество игр суточной нормы для поддержания соревновательного духа внутри клуба. Именно так, мы хотим поддержать идею и культуру традиций клубов былых времён в эпоху кибер-спортивных дисциплин.</div>
    <div class="vertLine"></div>
    <div
      class="t5 bigText2"
    >Каким бы новое место не было странным или подозрительным, завлекательным или отпугивающим, опасным и неприятным - такое испытание гораздо легче перенести вместе с другом. Верность, преданность и сострадание являются неотъемлемыми качествами истинной дружбы, где предстоящие трудности и преграды затмевают на пути перед сплоченностью и крепкой поддержкой твоего товарища. Для нашего клуба будет честью оказаться местом, где ценность морали и сила духа поддержки приветствуются среди участников. Поэтому мы будем всячески такое стремление развивать и поддерживать. Как первый шаг наш Клуб создает поощрительную программу. Пригласите своего друга через уникальный код в Вашем профиле и к началу бета версии проекта Вы получите денежное вознаграждение за активность Ваших товарищей.</div>
    <div style="position:absolute;height:93px;width:100%;top:969px"></div>
  </div>
</template>

<style >
.title {
  position: absolute;
  width: 414px;
  height: 58px;
  left: 455px;
  top: 43px;
}
.subTitle1 {
  padding-left: 30px;
  position: absolute;
  width: 632px;
  height: 48px;
  left: 0;
  top: 166px;
  font-style: italic;
}
.subTitle2 {
  position: absolute;
  width: 631px;
  height: 76px;
  left: 700px;
  top: 166px;

  font-style: italic;
}
.vertLine {
  position: absolute;
  width: 3px;
  height: 662px;
  left: 662px;
  top: 307px;
  background: #828282;
}
.autor1 {
  position: absolute;
  width: 117px;
  height: 32px;
  left: 516px;
  top: 262px;
}
.autor2 {
  position: absolute;
  width: 67px;
  height: 32px;
  left: 1257px;
  top: 262px;
}
.bigText1 {
  position: absolute;
  width: 552px;
  height: 544px;
  left: 0;
  top: 322px;
  padding: 40px;
  background: #f2f2f2;
}
.bigText2 {
  position: absolute;
  width: 552px;
  height: 416px;
  left: 691px;
  top: 322px;
  padding: 40px;
  background: #f2f2f2;
}
</style>