<template>
  <div>
    <div class="t1 suppotrT">Поддержка</div>
    <div class="t3 supportST">Написать в поддержку</div>
    <select class="themeSelect" value="Тема" name="Тема" id="1"></select>
    <textarea class="t5 supportMessage" placeholder="Расскажите о проблеме" type="textarea" />
    <button class="t4 buttonSend">Обратиться</button>
    <div class="t2 oldQuestion">Популярные вопросы</div>
    <ul class="answersList">
      <li :id="`q${i}`" v-for="i in quest.length" :key="i">
        <div class="t3 liTitile">{{quest[i-1]}}</div>
        <div class="t5 liText">{{answ[i-1]}}</div>
      </li>
    </ul>
    <ul class="oldQLink">
      <li style="margin-bottom:10px" v-for="i in quest.length" :key="i">
        <a style="color:#35A7FF" class="t5" :href="`#q${i}`">{{quest[i-1]}}</a>
      </li>
    </ul>
  </div>
</template>
<script>
export default {
  data() {
    return {
      quest: [
        "1. Как мне начать играть?",
        "2. В моей команде был руинер, что делать?",
        "3. Как мне вывести деньги и есть ли лимиты?",
        "4. Как мне сыграть со своим другом?",
        "5. Почему против меня попались сильные противники?",
        "6. Я забыл пароль, что делать?",
        "7. Я выиграл игру, но результаты игры были аннулированы. Почему?"
      ],
      answ: [
        "Для того чтобы начать свою первую игру, Ваш баланс должен быть не менее 1 DWD (Darewin’s Dollar). Bы можете приобрести DWD в разделе «Средства». Далее нажать кнопку «Найти игру» либо перейти в раздел «Игры» и выбрать подраздел «Текущие матчи». Если мест в доступных лобби не будет, тогда платформа автоматически создаст лобби и запишет Вас в участники предстоящего матча. Удачи Вам!",
        "Наш проект в первую очередь нацелен на создание достойного и добросовестного спортивно-игрового сообщества, поэтому мы всячески поощряем борьбу с «вредителями». Если Вы уверены в том, что в Вашей команде или команде противников был руинер/читер Вам нужно подать жалобу. Вы можете подать жалобу сразу после игры в разделе «Игры». Для этого Вам нужно перейти в подраздел «Прошедшие матчи», найти игру и нажать кнопку «Подать жалобу». Для более качественной и быстрой реакции на Ваше обращение, пожалуйста, укажите ник пользователя, проблему и приблизительное время инцидента внутри игрового процесса. Мы обязательно разберемся и решим Ваш вопрос.",
        "Для вывода Ваших средств Вам нужно перейти в раздел «Средства», выбрать подраздел «Вывод средств», определиться с суммой вывода и платежной системой, после чего нажать кнопку «Вывод». Вас перенесёт на страницу платежной системы, где Вы сможете уже завершить процесс вывода средств. Учтите, что лимиты по транзакциям могут быть установлены самой платежной системой. С нашей стороны требование только одно – Ваш баланс не должен быть меньше или равен 0.",
        "Для того чтобы сыграть со своим другом, Вы в первую очередь должны пригласить его стать участником клуба. Отправьте ему уникальный промо-код, который находится в Вашем профиле, и как только он зарегистрируется, добавьте его в свои друзья на платформе. Для этого перейдите в раздел «Друзья», в строке поиска введите его ник на сайте и нажмите кнопку «Добавить друга». После чего Вы можете добавить его в игровое пати. Но учтите, чтобы играть матчи командного формата, Вам нужно иметь состав из пяти человек. В противном случае Вы будете играть только соло формат с режимом Team Balance.",
        "Как в реальной жизни, так и в нашем клубе, состязания – это процесс соревновательный, при котором участники борются за право быть лучшими в матче. Вы должны понимать, что Вы не всегда будете побеждать, так как противников очень много и они все хотят победить. Поэтому мы рекомендуем Вам подходить к играм со всей ответственностью и четким пониманием всех элементов внутри игрового процесса. В ближайшем будущем будет создана четкая система матчмейкинга по скиллбрекету, которая будет разделять на дивизионы игроков, чтобы слабые игроки чувствовали себя комфортно при уровне своей игры и равными противниками.",
        "Как в реальной жизни, так и в нашем клубе, состязания – это процесс соревновательный, при котором участники борются за право быть лучшими в матче. Вы должны понимать, что Вы не всегда будете побеждать, так как противников очень много и они все хотят победить. Поэтому мы рекомендуем Вам подходить к играм со всей ответственностью и четким пониманием всех элементов внутри игрового процесса. В ближайшем будущем будет создана четкая система матчмейкинга по скиллбрекету, которая будет разделять на дивизионы игроков, чтобы слабые игроки чувствовали себя комфортно при уровне своей игры и равными противниками.",
        "В нашем клубе работает четкая система анализа матчей и грамотный алгоритм службы поддержки. Если результат матча, в котором Вы принимали участие, был аннулирован, то это могло произойти по нескольким причинам, к примеру, Ваша победа не была достойной, потому что в команде противника был руинер, либо в игре присутствовал читер, либо игроки разных команд были уличены в тиминге, чтобы сорвать проведение матча. Одним словом, если Вы играли честно и не нарушали правила клуба, в любом случае Ваше потраченное время и приложенные усилия будут компенсированы в денежном эквиваленте, а нарушители понесут наказание."
      ]
    };
  }
};
</script>
<style >
.oldQLink {
  position: absolute;
  width: 332px;
  height: 386px;
  left: 992px;
  top: 42px;
  list-style-type: none;
}
.liTitile {
  width: 785px;
  margin-bottom: 14px;
}
.liText {
  width: 785px;
  margin-bottom: 32px;
}
.themeSelect {
  position: absolute;
  width: 789px;
  height: 44px;
  left: 0px;
  top: 187px;
  background: #ffffff;
  border: 1px solid #bdbdbd;
  box-sizing: border-box;
}
.suppotrT {
  position: absolute;
  width: 198px;
  height: 58px;
  left: 0px;
  top: 42px;
}
.supportST {
  position: absolute;
  width: 261px;
  height: 38px;
  left: 0;
  top: 132px;
}
.supportMessage {
  position: absolute;
  min-width: 789px;
  min-height: 216px;
  max-width: 789px;
  max-height: 216px;
  left: 0;
  padding: 17px 21px;
  top: 250px;
  border: 1px solid #bdbdbd;
  box-sizing: border-box;
  border-radius: 4px;
}
.buttonSend {
  position: absolute;
  width: 170px;
  height: 40px;
  left: 619px;
  top: 482px;
  background: #1f2430;
  border-radius: 6px;
  color: white;
}
.oldQuestion {
  position: absolute;
  width: 311px;
  height: 48px;
  left: 0;
  top: 675px;
}
.answersList {
  margin: 0;
  padding: 0;
  position: absolute;
  width: 296px;
  height: 38px;
  left: 0;
  top: 755px;
  list-style-type: none;
}
</style>