<template>
  <div class="main-div4">
    <Header headerColor="#f2f2f2" class="header" />
    <div class="logo"></div>
    <div style="color:white;position: absolute;
left: 200px;
top: 166px;" class="t1">FAQ</div>
    <div>
      <div>
        <ul id="FAQUl">
          <li
            :class="{ focusedLi: 0 == focused, t5: true }"
            @click="ChangeQuestion(0)"
          >{{ $ml.get("p4q1") }}</li>
          <li
            :class="{ focusedLi: 1 == focused, t5: true }"
            @click="ChangeQuestion(1)"
          >{{ $ml.get("p4q2") }}</li>
          <li
            :class="{ focusedLi: 2 == focused, t5: true }"
            @click="ChangeQuestion(2)"
          >{{ $ml.get("p4q3") }}</li>
          <li
            :class="{ focusedLi: 3 == focused, t5: true }"
            @click="ChangeQuestion(3)"
          >{{ $ml.get("p4q4") }}</li>
          <li
            :class="{ focusedLi: 4 == focused, t5: true }"
            @click="ChangeQuestion(4)"
          >{{ $ml.get("p4q5") }}</li>
          <li
            :class="{ focusedLi: 5 == focused, t5: true }"
            @click="ChangeQuestion(5)"
          >{{ $ml.get("p4q6") }}</li>
          <li
            :class="{ focusedLi: 6 == focused, t5: true }"
            @click="ChangeQuestion(6)"
          >{{ $ml.get("p4q7") }}</li>
          <li
            :class="{ focusedLi: 7 == focused, t5: true }"
            @click="ChangeQuestion(7)"
          >{{ $ml.get("p4q8") }}</li>
          <li
            :class="{ focusedLi: 8 == focused, t5: true }"
            @click="ChangeQuestion(8)"
          >{{ $ml.get("p4q9") }}</li>
          <li
            :class="{ focusedLi: 9 == focused, t5: true }"
            @click="ChangeQuestion(9)"
          >{{ $ml.get("p4q10") }}</li>
        </ul>
      </div>
      <div
        style="color:white;position: absolute;
                    max-width:840px;
                    left: 879px;
                    top: 224px;"
      >
        <div class="t2">{{ $ml.get(`p4q${focused + 1}`) }}</div>
        <div style="margin-top:24px;transition:2s" class="t4">{{ $ml.get(`p4t${focused + 1}`) }}</div>
      </div>
    </div>
    <Lang />
    <div class="t4 alfa">{{ $ml.get("alfa") }}</div>
  </div>
</template>
<script>
import Header from "./General/Header";
import Lang from "./General/Lang";

export default {
  components: { Header, Lang },
  data() {
    return {
      focused: 0,

      answers: [
        "В первую очередь – мы киберспортивный клуб. Или, проще говоря, мы то место, где вы сможете реализовать свои соревновательные амбиции и получить вознаграждение за свои старания.",
        "Мы не лучше. Мы – другие. Деятельность клуба не связана с букмекингом, здесь не торгуют “шмотом”, мы не дарим бесплатные спины, и тем более не предлагаем вам купить аналитику, чтобы вывести вашу игру “на кардинально новый уровень”. Клубный пропуск даёт вам возможность принимать участие в играх и получать до 100% (а в исключительных случаях и больше) от взноса в игру. По факту – Вы играете на победу.",
        "Проблема абсолютно всех современных игр, которые можно назвать киберспортивными или по другому – соревновательными в том, что обычные игроки не ценят саму игру или время проведённое в ней. Только единицы становятся спортсменами и получают гонорар. А остальным приходится довольствоваться бустерами, смурфами, геймруинерами и просто анманерами. Все они отбивают интерес к игре у обычного пользователя. Единственный способ решить этот вопрос – заставить игрока относиться серьезнее к процессу игры. Соответсвенно, деньги являются неотъемлемой материальной составляющей для клубных игр.",
        "Мы являемся серьезным проектом. И поэтому решили делать все поэтапно. Сейчас сайт и клубные игры находятся в альфа-тестировании. Абсолютно все игровые взносы будут равны 1 дукату (DWD), который равен в свою очередь 1 американскому доллару (USD). Небольшая плата за весомые привелегии, согласны?",
        "К счастью – не так. Мы являемся зарегистрированной компанией и ведём свою деятельность согласно установленным нормам законодательства. Более того, на период альфа-тестирования наша компания не будет взымать с участников комиссию за проведённые игры.",
        "Наша выгода заключается в том, что мы гарантированно создадим киберспортивное общество, которое будет серьезнее относится к процессу игр. Убрать комиссию на период альфа-тестирования – более чем верный шаг.",
        "На период бета-тестирования доступна только одна игра – Dota2. Соло или командный режим – выбор за вами. Но правила будут как на соревнованиях, чтобы заставить игроков стараться принимать правильные решения – Captains mode, Bo1.",
        'Мы уважаем ваше драгоценное время. Поэтому хотим сказать, что бета-версия будет запущена, как только будет необходимый объём дневных игр для поддержания соревновательного духа внутри клуба. В бета-версии будет доступно большое количество игр и множество разных "фич и плюшек". Ну а участники альфа-тестирования получат вознаграждение за свои старания, когда проект перейдёт в бета-версию.',
        "В нашем клубе доступны разные способы перевода средств. Выберите себе тот, который подходит лично вам. Все способы абсолютно безопасны и гарантируют вам сохранность данных при переводе средств. Просим обратить ваше внимание на то, что комиссия может взыматься вашим банком или платежной системой за перевод средств и/или внутреннюю конвертацию валюты.",
        "В нашем клубе работает поддержка участников. Мы отвечаем на умные (и не очень) вопросы, наблюдаем за честными (и не очень) игроками, а также, решаем очевидные (и не очень) споры, чтобы участники знали, что игры в Darewin's Club всегда Fair Play. Пусть вам улыбается фортуна."
      ],
      CurrentQuestion: "Что это такое?" || questions[0],
      CurrentQuestionAnswer:
        "В первую очередь – мы киберспортивный клуб. Или, проще говоря, мы то место, где вы сможете реализовать свои соревновательные амбиции и получить вознаграждение за свои старания." ||
        answers[0]
    };
  },
  methods: {
    ChangeQuestion(index) {
      this.focused = index;
    }
  }
};
</script>
<style>
.logo {
  background: url(../assets/DarewinLargeWhite.svg);
  position: relative;
  left: 200px;
  top: 60px;
  width: 174px;
  height: 36px;
}

.header {
  float: right;
  margin-top: 60px;
  margin-right: 164px;
  color: white;
}
.main-div4 {
  width: 100%;
  height: 100vh;
  background: linear-gradient(297.51deg, #292f40 0%, #9b9ea7 100%), #f2f2f2;
}
.alfa {
  position: absolute;
  left: 200px;
  top: 904px;
  color: white;
}

#FAQUl {
  padding: 0;
  position: absolute;
  left: 200px;
  top: 214px;
  list-style-type: none;
}
#FAQUl li {
  padding: 10px 0;
  color: #bdbdbd;
  max-width: 523px;
  cursor: pointer;
}
#FAQUl li:hover {
  color: #adb4ca;
}
.focusedLi {
  color: #f2f2f2 !important;
}
</style>
