<template>
  <div class="main-div">
    <Header class="header" />
    <div class="logo"></div>
    <div style="color:white;position: absolute;
left: 200px;
top: 166px;" class="t1">FAQ</div>
    <div>
      <div>
        <ul id="FAQUl">
          <li
            :class="{focusedLi:index==focused,t5:true}"
            @click="ChangeQuestion(index)"
            v-for="(q,index) in questions"
            :key="index"
          >{{q}}</li>
        </ul>
      </div>
      <div
        style="color:white;position: absolute;
                    max-width:840px;
                    left: 879px;
                    top: 224px;"
      >
        <div class="t2">{{CurrentQuestion}}</div>
        <div style="margin-top:24px;transition:2s" class="t4">{{CurrentQuestionAnswer}}</div>
      </div>
    </div>

    <div class="t4 alfa">Альфа версия</div>
    <ul class="t4 lengUl">
      <li>RU</li>
      <li>ENG</li>
    </ul>
  </div>
</template>
<script>
import Header from "./General/Header";

export default {
  components: { Header },
  data() {
    return {
      focused: 0,
      questions: [
        "Что это такое?",
        "Я уже где-то такое слышал, и чем вы лучше?",
        "Секунду, я что должен перевести деньги?",
        "У меня нет денег. Или я похож на Била Гейтса",
        "Очень похоже на кидалово, не так ли?",
        "В чем ваша выгода?",
        "А какие игры сейчас доступны в клубе?",
        'Ясно. Когда бета-версия? Не очень хочу тратить своё время на альфа-тестирование "супер-пупер" проекта...',
        "Ладно. Даже если я переведу средства на свой клубный счёт, то как мне забрать их обратно, не говоря уже о призовых?",
        "Вижу это уже последний пункт, но я не нашёл ответа на свой вопрос. Кто мне поможет?"
      ],
      answers: [
        "В первую очередь – мы киберспортивный клуб. Или, проще говоря, мы то место, где вы сможете реализовать свои соревновательные амбиции и получить вознаграждение за свои старания.",
        "Мы не лучше. Мы – другие. Деятельность клуба не связана с букмекингом, здесь не торгуют “шмотом”, мы не дарим бесплатные спины, и тем более не предлагаем вам купить аналитику, чтобы вывести вашу игру “на кардинально новый уровень”. Клубный пропуск даёт вам возможность принимать участие в играх и получать до 100% (а в исключительных случаях и больше) от взноса в игру. По факту – Вы играете на победу.",
        "Проблема абсолютно всех современных игр, которые можно назвать киберспортивными или по другому – соревновательными в том, что обычные игроки не ценят саму игру или время проведённое в ней. Только единицы становятся спортсменами и получают гонорар. А остальным приходится довольствоваться бустерами, смурфами, геймруинерами и просто анманерами. Все они отбивают интерес к игре у обычного пользователя. Единственный способ решить этот вопрос – заставить игрока относиться серьезнее к процессу игры. Соответсвенно, деньги являются неотъемлемой материальной составляющей для клубных игр.",
        "Мы являемся серьезным проектом. И поэтому решили делать все поэтапно. Сейчас сайт и клубные игры находятся в альфа-тестировании. Абсолютно все игровые взносы будут равны 1 дукату (DWD), который равен в свою очередь 1 американскому доллару (USD). Небольшая плата за весомые привелегии, согласны?",
        "К счастью – не так. Мы являемся зарегистрированной компанией и ведём свою деятельность согласно установленным нормам законодательства. Более того, на период альфа-тестирования наша компания не будет взымать с участников комиссию за проведённые игры.",
        "Наша выгода заключается в том, что мы гарантированно создадим киберспортивное общество, которое будет серьезнее относится к процессу игр. Убрать комиссию на период альфа-тестирования – более чем верный шаг.",
        "На период бета-тестирования доступна только одна игра – Dota2. Соло или командный режим – выбор за вами. Но правила будут как на соревнованиях, чтобы заставить игроков стараться принимать правильные решения – Captains mode, Bo1.",
        'Мы уважаем ваше драгоценное время. Поэтому хотим сказать, что бета-версия будет запущена, как только будет необходимый объём дневных игр для поддержания соревновательного духа внутри клуба. В бета-версии будет доступно большое количество игр и множество разных "фич и плюшек". Ну а участники альфа-тестирования получат вознаграждение за свои старания, когда проект перейдёт в бета-версию.',
        "В нашем клубе доступны разные способы перевода средств. Выберите себе тот, который подходит лично вам. Все способы абсолютно безопасны и гарантируют вам сохранность данных при переводе средств. Просим обратить ваше внимание на то, что комиссия может взыматься вашим банком или платежной системой за перевод средств и/или внутреннюю конвертацию валюты.",
        "В нашем клубе работает поддержка участников. Мы отвечаем на умные (и не очень) вопросы, наблюдаем за честными (и не очень) игроками, а также, решаем очевидные (и не очень) споры, чтобы участники знали, что игры в Darewin's Club всегда Fair Play. Пусть вам улыбается фортуна."
      ],
      CurrentQuestion: "Что это такое?" || questions[0],
      CurrentQuestionAnswer:
        "В первую очередь – мы киберспортивный клуб. Или, проще говоря, мы то место, где вы сможете реализовать свои соревновательные амбиции и получить вознаграждение за свои старания." ||
        answers[0]
    };
  },
  methods: {
    ChangeQuestion(index) {
      this.CurrentQuestion = this.questions[index];
      this.CurrentQuestionAnswer = this.answers[index];
      this.focused = index;
    }
  }
};
</script>
<style >
.logo {
  background: url(../assets/DarewinLargeWhite.svg);
  position: relative;
  left: 200px;
  top: 60px;
  width: 174px;
  height: 36px;
}

.header {
  float: right;
  margin-top: 60px;
  margin-right: 164px;
  color: white;
}
.main-div {
  width: 100%;
  height: 100vh;
  background: linear-gradient(297.51deg, #292f40 0%, #9b9ea7 100%), #f2f2f2;
}
.alfa {
  position: absolute;
  left: 200px;
  top: 904px;
  color: white;
}
.lengUl {
  position: absolute;
  width: 31px;
  height: 36px;
  left: 1624px;
  top: 904px;
  margin: 0;
  padding: 0;
}
.lengUl li {
  display: inline;
  margin-right: 32px;
}
.lengUl li:first-child {
  color: #f2f2f2;
}
#FAQUl {
  padding: 0;
  position: absolute;
  left: 200px;
  top: 214px;
  list-style-type: none;
}
#FAQUl li {
  padding: 10px 0;
  color: #bdbdbd;
  max-width: 523px;
  cursor: pointer;
}
#FAQUl li:hover {
  color: #adb4ca;
}
.focusedLi {
  color: #f2f2f2 !important;
}
</style>